Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 아까 네가 속마음을 인정하게 한 후로
en: after you made her admit her true feelings,

source: 이 새낀 축젠데 여기서 뭐하냐?
en: what’s this fool doing during the festival?

source: 근데도 왜 그 자식의 속내를 파악 못하는 건지…
en: so why can’t she figure that jerk out?!

source: 뭐야 ㅆ발!!!!!!
en: what the f*ck!!!!!!

source: 내 최면은 질문엔 잘 먹힌다는 점이야
en: my hypnosis works really well when asking questions!

source: 응.
en: okay.

source: 그쵸 찬규 님…?
en: am I right, master chankyu?!

source: 됐다..
en: forget it.

source: 괜찮아?!{j}해림아!!
en: haerim!! are you okay?!{j}

source: 말했었잖아, 아까.
en: remember what I said earlier?

source: 최면 걸린 척하고 있는 거라고
en: she’s pretending to still be hypnotized.

source: 얘 진짜 이상해… ㅠㅠ
en: he’s really weird...

source: 그래, 그래!
en: yes, that’s right!

source: 겨우 양말인데.뭐
en: they’re just socks.

source: 생각 ㅈㄴ 꼬인게 너답다 응
en: it’s just like you to think of it in such a twisted way.

source: 어쩌면… 어쩌면 나랑 같을지도 몰라
en: he might... actually be the same as me.

source: 지금 눈의 힘을 가지고 있는 건 여의주에요
en: euijoo has the power of the dragon’s eyes.

source: …그게
en: is that...

source: 처억
en: DA DUN

source: 상큼한 척 웃지 마 무서워
en: don’t act innocent like that. it’s freaky.

source: 개수작엔 더 더러운 개수작이다!
en: ...and an even filthier trick for a filthy trick!

source: 뭐, ㅅ발?
en: what’d you just say, f*cker?

source: 큰 상처도 아닌데 뭐.
en: it wasn’t even a big scratch.

source: 크윽…!
en: ugh!

source: 아니!!
en: no, I mean...

source: 쟤 3일 전에 깨졌어
en: he broke up with a girl three days ago.

source: 스콘 어때?!
en: how’s the scone?!

source: 겨우 눈을 찾아놨더니…
en: I finally found the dragon’s eyes...

source: 바보, 바보!!
en: really mean!!

source: 내가 방송댄스 동아리라서 이따가 무대하거든!
en: I’m in the dance club, so I’ll be on stage later today!

source: 미친!!
en: no way!

source: 너무해!!
en: you’re so mean!!

source: …어?
en: huh?

source: 다들 학기초 때 부활동 필수로 정하는 시간이 있었는데,
en: everyone’s required to sign up for a club at the start of the semester.

source: 얘기나 해보라고
en: explain yourself then.

source: 우리 같은 이 능력자 들은 사람들을 위해 행동해야 해
en: ...people with super powers like you and me should use them for others.

source: 대체 여길 왜 파고 있는 거야?
en: why the hell are you digging a hole here?

source: 으아아~~
en: aaargh!

source: 뭐긴, 뭐야 도서관 안쪽 끝나고 부장이 너 도와주래서 왔지
en: I finished cleaning the library, so the club president told me to come help you, fool.

source: 엄청 속상해!!
en: I’m really upset!!!

source: 상금이 크긴 하네… 그래도 무슨
en: that’s a big prize... but still.

source: 수호령 생김새가 왜 그따위냐
en: yet you look like that?

source: 아, 진짜?
en: oh, really?

source: 아 그런 표정 짓지마 사귀는 것도 아닌데;
en: uh... stop it with that face. we’re not really dating.

source: 야 진정해 봐!!
en: hey, calm down!!!

source: 어, 진짜 여기 있었네?
en: oh, you were really here.

source: 옆에서 봐도 뻔히 보이는 걸 모를 정도면,
en: if euijoo can’t notice it even though he’s using his power right in front of her...

source: 연습에 올인 하느라~
en: I’ve been so busy recently practicing all day.

source: 그럼 될 때까지 반복하면∙∙∙ ∙∙∙
en: then we can repeat it until it works...

source: 양말 벗어놨는데 깜빡하고 못 챙겨서 잃어버렸어
en: ...so I came to get my socks, but I must have lost them.

source: 나도 달라지고 싶지만
en: I want to change...

source: 아, 그~
en: oh, that’s--

source: 네 욕이겠지ㅋㅋ
en: nah, they’re probably talking about you, lol.

source: 댓글공약은 노이즈 마케팅으로 사용되었었다.
en: comments were used for noise marketing.

source: 아, 미정…
en: oh, mijung...

source: 닥쳐 진짜 말 존ㄴ 심해 ㅅ발..
en: shut up, you b*tch.

source: 정말 이상해, 김찬규…!
en: but there’s something really strange about him!

source: 그게 나보다 중요해?!
en: that isn’t more important than me, is it?!

source: 어디까지 알고 있는 거야?
en: how much do you know?

source: 쟤들은 책임감도 없이 능력을 쓰는데…
en: they used their superpowers irresponsibly...

source: 맞아, 선생님이 부른다고 하던데
en: yeah, I heard the teacher asked for her.

source: 답은 상담 부다
en: the counseling club. that’s the answer.

source: 6 체
en: 6 P

source: 난 네가 진심으로 좋은 애인 건 알아!
en: ...but I do know that you’re a really good kid!

source: 난 스스로 상담부에 왔어.
en: it was my choice to come to the counseling club.

source: … 왜 남자가 아닌 건데…?
en: why aren’t you a boy?

source: 허억!
en: gasp!

source: 왜 둘이서…
en: why are they alone?

source: 불만 있니 친구야?
en: why? is there a problem, friend?

source: 경익 혜진
en: Gyeong-ik Hyejin

source: 기가 약한 인간이 내 기를 얼마나 버티겠어…
en: a person with weak energy can’t withstand mine...

source: …뭐야?
en: huh?

source: 아니야?
en: so it wasn’t you?

source: 안되겠어 김찬규 그걸 쓰자!
en: chankyu, we should use that! there’s no other choice!

source: 하지만 그거 아니?
en: but did you know?

source: 근데..
en: but...

source: ~먹을걸로 모면 한 위기~
en: FOOD SAVED US!

source: 모르핀!!
en: morphine!

source: 저건…!
en: that’s-!

source: 어디 있는데, 우리 아빠는?
en: where’s my dad?

source: 그건…!
en: that’s-!

source: 우선 낫는 거 먼저 생각하자
en: so focus on recovering, got it?

source: 용의 뿔?
en: and its horn?

source: 이제 성불을 포기하라고 말하면…!!
en: now we just need to ask her to give up on sending the ghost away!!!

source: 일단 해라
en: so, go date someone first.

source: 작전-
en: let’s...

source: 그래서 그 말이 뭔데요!!
en: but what words were you talking about?!

source: 아 씨ㅂ
en: damn it!

source: 꾸욱
en: CLENCH

source: 이번에도 회생이 될까…?!
en: can I be revived again?!

source: 김우찬 담당 일진 김세진!
en: woochan’s bully, sejin kim!

source: 가자!!
en: let’s go!!!

source: 제발…!!
en: pleeease?!

source: 그래 그래도 난 좋아해 주는 애들 있으니까
en: I thought, “well, at least a lot of boys like me.”

source: 아니, 아무리 미화 부라도 진짜 축제 때까지 환경 미화하는 거냐고
en: come on, does the beautification club only beautify the facilities the entire festival?

source: 어차피 돌아갈 텐데 말해봐.
en: tell me. I’ll be going back anyway.

source: 그 눈빛…!
en: but her eyes-!

source: 당연하지!
en: of course!

source: 네 고민은 네가 해결했으니 다음은…
en: now that you’ve resolved your concerns, the next thing is...

source: 능력 조절이야!
en: he can control them!

source: 방금 무슨…?
en: what just happen--

source: 뭐..
en: no.

source: 전혀 가능성이 없는 건 아냐!!
en: it isn’t impossible!!!

source: 아까 교실에서… 너도 봤지?
en: you saw it... earlier in the classroom, right?

source: 진주가 요즘…
en: I think pearl...

source: 귀신이 아버지 령 불러낸 거 말이야
en: didn’t you summon the spirit of the ghost’s father?

source: 우리 아빠는 버려두고 잊은 채로…?
en: my dad was abandoned and left to die...

source: 빨리 저 새끼를 떼어내 버려야 마음이 편해질 것 같아
en: I think I’ll feel better once I lose him.

source: 뜬금없이 책상 위에 이런 게 있나…?
en: how random... why is this on the desk?

source: 그 규칙과 책임을 잘 지키지 않으면 안 된단다
en: you must abide by those rules and responsibilities.

source: 이번엔 무슨 협박을 했지?
en: were you blackmailed again?

source: 하하하
en: HAHAHA

source: 너 왜 안 뒤졌냐?
en: why aren’t you gone yet?

source: 그런 과정에서 나는 남을 돕던 아버지를 닮아가고 있었다
en: I ended up following my father’s footsteps in the process.

source: 이거봐!
en: look!

source: 뭐 ㅆ발?!
en: what, b*tch?!

source: 네가 한거 아니에요?
en: wasn’t it you?

source: 어 근데… 성불하면
en: but, uh... isn’t it a good thing...

source: 넌 요 며칠간을 계속 반복하고 있어
en: you’ve been living the last few days on repeat.

source: 자
en: here.

source: …알겠는데…
en: yeah, I did...

source: 어?!
en: huh?!

source: 진주야~
en: pearl!

source: 본 모습이야?
en: your real appearance?

source: 너 이제 수호령이라며!!
en: you’re a guardian spirit now, aren’t you?

source: …됐고, 뭔데 방해질이야?
en: enough of that. who are you to get in the way?

source: 뭐지 이 천뭉치는…?
en: what’s this... chunk of cloth?

source: 이젠 무책임해지지 않을거다.
en: so now, we’ll start taking responsibility.

source: 그거 오늘까지였잖아.
en: it was due today.

source: 전혀…!
en: ...suddenly...

source: 니가 다칠 것 같아서 미리 챙겼었어
en: I brought one with me because you might get hurt.

source: 뭐야 귀신의 아버지면 지금은 이미 죽…
en: huh? a ghost’s father? then he’s probably already dea--

source: 지 같은 거 달고 있네…
en: no wonder you’re wearing that huge name tag...

source: 그건 안돼!!
en: no! not that!!!

source: 너 데리러 가는 타이밍을 딱 맞추고 싶었거든.
en: we wanted to know exactly when to get you.

source: 다가오지 마!!
en: don’t come near me!!!

source: 영력!
en: your spiritual energy!

source: 네 무의식은 다소 폭력적이지만 너에 대해 더 잘 아는 것 같네
en: your subconscious is a bit aggressive, but it seems like you know yourself quite well.

source: 누가 보면 지가 가자 그런 줄 알겠네
en: and it’s not like you asked me to come.

source: 그건… 미안…
en: sorry... about that...

source: 하지만 저 의지를 꺾지 못해
en: but it won’t break that determination.

source: 뭐지… 좀 좋은 냄새가 나는데… 섬유 유연제?
en: this... smells kinda good... is it fabric softener?

source: 나랑 계약 연애 하자마자 ㅈ같아한 이유가 뭐지?!
en: ...why were you so disgusted when we started the contract relationship?!

source: 감정적인 선택은 대부분 나중에 가서야 후회한다.
en: most emotional decisions end in regret.

source: ㅆ발…!
en: f*ck!

source: 내가 김찬규 상대로 무슨 걱정을.
en: why am I even worried about chankyu kim?

source: 그냥 나한테 영력 좀 주려고 의도만 가져도 돼.
en: you just need to want to give it to me.

source: 한번 들어보자
en: let’s hear her out.

source: 아,
en: oh...

source: 개소리야!!
en: bullsh*t!!!

source: 아직 너 용서한 거 아님
en: I haven’t forgiven you yet.

source: 또 다 망칠텐데..
en: I might ruin it all again...

source: 진짜… 연애 해본적이 없는거야…?
en: you’ve... never dated? really?

source: ……차라리 찐ㄸ가 낫겠군
en: I’d rather be a total loser...

source: 학교가 지어졌잖니
en: ...was built.

source: 내가 말하려고 했는데에~!!
en: I wanted to tell her!!!

source: 누군 읽고 싶어서 읽는 줄 알아
en: I don’t want to read them either.

source: 또 무슨 일 있었냐?
en: did something else happen?

source: 아, 아무것도 아냐!
en: i-it’s nothing!

source: 살인 충동뿐이야!
en: of nothing but murder!

source: 찝찝하게 저딴 놈이랑 얽혀선…
en: ...have to get involved with a weirdo like him?

source: 비싼 거 고르자
en: let’s pick out something pricey!

source: 아냐 내가 같이 오자고 한 건데 두고 가면 좀 그렇잖아
en: I don’t. since I asked you to come with me, I shouldn’t leave first.

source: 남은 이들이 결정할 몫이다
en: ...is for those left behind to decide.

source: 야… 이미진…?
en: hey... mijin?

source: 이 기억을 가지고 가는 게 더 중요해
en: it’s more important for me to take my memories back with me.

source: 더 강한 최면이 필요하다
en: I need to use a stronger hypnosis.

source: 뭣…
en: what the-...

source: 그래도 의주 네 일인데~
en: well, it did involve you, euijoo.

source: 영준이라고 씨ㅂㄴ아
en: the name’s youngjun, you bastard!

source: 알
en: Not

source: 그건…
en: that’s...

source: 근데…
en: but...

source: 아!
en: ah!

source: … 당연한 일을 한 건데요, 뭐!
en: I only did what I was supposed to do!

source: 연애랑 계절이랑 상관없다.
en: dating and seasons have nothing to do with each other.

source: 영어
en: English

source: 찾았어…요
en: I found it... sir.

source: 그렇게 용의 힘을 물려 받은 이들은 지금에 와서
en: these people who inherited the dragon’s power...

source: 그럴지두?
en: maybe?

source: 엉?
en: eh?

source: 어쩌라구~ 지금 내 남친인데
en: so what? he’s my boyfriend right now.

source: 방금 껀 장난이었는데… 무슨 소린지 아시죠?
en: I wasn’t kidding just now... you know what I mean, right?

source: 이, 이미진… 오… 하이?
en: m-mijin... uh... hi?

source: 아…그…안녕… 하세요…///
en: oh... uh... hello, master...

source: 야
en: hey!

source: 어!?
en: huh?!

source: 아아~
en: oh...

source: 걱정 마~~!
en: don’t worry about that!!!

source: 시끄러워
en: shut up!!!

source: … 응////
en: okay!

source: 23년간 놀릴 거리다 뭔가 방법이…!
en: he’ll tease me for 23 whole years! there has to be a way!

source: 소화기
en: FIRE EXTINGUISHER

source: 이미진이
en: you’re saying mijin...

source: 최면은 아니야.
en: you’re not hypnotized.

source: 연기 그만해라 이미진
en: mijin. enough of your acting.

source: 이딴 걸 그림이라고 그리냐 아무리 고딩축제라도 개 ㅈ밥같이 그리네
en: they call this art? I know they’re just high schoolers, but still... this is damn ugly.

source: 한 명 더 있어
en: there’s one more.

source: 그럼 답을 내려주지
en: then here’s your answer.

source: 날 방해하고 싶은 거라면 알려서 좋을 게 없을 텐데.
en: if you want to stop me, it wouldn’t help to tell me.

source: 너 혹시… 이번에 무대 같은 거 올라가?
en: by any chance... are you going up on some kind of stage?

source: 그냥… 상대가 나라서… 애들이…ㅋㅋ…
en: they’re just... saying that... ‘cause of me... haha...

source: 후후… 난 이 학교를 수호하는 수호령이 된 거라고!
en: heh heh... I’m a guardian spirit that protects this school now!

source: 그딴 능력… 뭐가 그렇게 중요한데?
en: what’s so important... about that super power?

source: 하는 짓은 이상해도…
en: she does act a bit strange...

source: 오늘을 위해 의상 풀셋으로 대여해온 거라고!
en: I rented the entire outfit from head to toe especially for today!

source: 시계의 본질은 정교한 기계인가 시간을 알리는 것인가.
en: are clocks supposed to be sophisticated machines or tell time?

source: 내 최면을 최대한 활용해 보는 거야…!
en: I’ll use my hypnosis the best I can!

source: 뭐?!
en: what?!

source: 이거 왜 이래?
en: what’s up with this dude?

source: 건강히 기다려야 해
en: be well... and wait for me.

source: … 이 학교가 세워졌다고…?
en: and this school... was built on top... of him?

source: 상벌현황
en: Announcements

source: 시간 돌리는 ㄴ
en: the b*tch that turns back time.

source: 진짜 기말에 올인 하는 수밖에 없나∙∙∙ ∙∙∙ .
en: do I really have only finals to fall back on?

source: 너도 의주도, 날 많이 생각해 준 거 알고 있어
en: you and euijoo have helped me a lot, too.

source: 김찬규, 뭐 하냐?
en: chankyu, what are you doing?

source: 시체라도 찾고 싶어!
en: ...I want to find his body!

source: 아까 나가는 것 같던데?
en: I think I saw her go outside just now.

source: 정확히는
en: rather...

source: 젠장 다 끝인가?
en: sh*t! are we done for?

source: 내가 요즘 정신없어서 말을 못 했네!
en: I forgot to tell you!

source: 다 알아, 넌 김태희한테서 나온 귀신도 아니고
en: I know you’re not a ghost that came from taehee.

source: 시간이 흘러
en: time passed.

source: 닥쳐라 안경 돼지!!!
en: shut up, you four-eyed pig!!!

source: 정신차려 여의주…
en: get yourself together, euijoo...

source: 미… 아, 아파!!
en: sor- ow! it hurts!!!

source: 좀… 잘생겼다…?
en: he’s... kinda cute...

source: 넌… 뭐야…!
en: what... you!

source: 니가 왜?
en: why? what’s wrong with that?

source: 별로 기대로 안 했거든?
en: I didn’t expect much from you anyway.

source: 이득을 위해 쓰는 이기주의자잖아?
en: you’re a selfish brat who uses her super power for herself.

source: 그러게, 되게 안 맞네…
en: yeah... what terrible timing...

source: 은근 맘에 들어-
en: I kinda like him...

source: 지옥의 기말고사 시작.
en: the hellish week of finals begins.

source: 나랑 사귀자고 해서 사귀어 줬고,
en: she asked me to be her boyfriend, so I obliged.

source: 인저엉?
en: riiight?

source: 못 찾아
en: we can’t find him.

source: 하지만!!
en: but...

source: 흠∙∙∙ ∙∙∙ .
en: hmmm...

source: 30분전
en: 30 minutes ago

source: 반응 뭔데!!
en: what’s with that response?!

source: 당장 돌려, 손목 부러지기 싫으면.
en: do it now, or I’ll break your wrist.

source: 그리고 너희들이 아무리 그래봤자 영력은 내가 한 수 위…
en: besides, whatever you guys do, my spiritual energy is much stronger.

source: 뭐 어때 이 모습이 익숙하지 않아?
en: besides, aren’t you guys more familiar with this look anyway?

source: 찬규야,
en: chankyu.

source: 너가 이정도는 아니잖니?
en: you aren’t... at this level, are you?

source: 왜…
en: why...?

source: 아~ 뭔데, 말해봐!!
en: ugh, just tell me! what is it?!

source: 나한테 물어봐
en: ask me.

source: 시합끝나고 보기로 했으면서 보이질 않아-!!
en: she promised to see me after the tournament!!!

source: 갑자기 뭔 소리야.
en: what the hell are you talking about?

source: 그, 그건 그렇ㅈ…
en: w-well... that’s tru--

source: 킥킥…
en: heehee...

source: 넌… 괜찮…
en: so you... don’t have to...

source: 하필 얽혀도…
en: why did we...

source: 쟨 나 같은 찐따랑 같이 다니는 게 안 쪽팔린 건가?
en: is she really not embarrassed about hanging out with a loser like me?

source: 왜지…?
en: why?

source: 그래도 뭐, 급하게 생각할 것 없지
en: well, I suppose there isn’t really a rush.

source: 뭐야 ㅅ발??
en: what, you son of a b*tch??

source: 어디가^^
en: you’re in a contract relationship with me.

source: 음…글쎄 그냥 바삭하기만 하고 별로…
en: um... I’m not sure. it’s just crunchy...

source: 혹시 분홍색에 흰색 꽃무늬 발목 양말을 보신 분은 방송부에 가져다주시길 바랍니다-!
en: if anyone has found a pink sock with white flowers, please bring it to the broadcasting office!

source: 아, 진짜-!!
en: ugh, I’m serious!!!

source: 그래, 차라리 잘됐다
en: well, this is probably better.

source: ~개논리~
en: totally illogical

source: 아니… 그래도…
en: well... but...

source: '찬규' 해버리네 이걸ㅋㅋ
en: LOL looks just like u chankyu

source: 나랑 계약 연애를 하자!!
en: let’s do a contract relationship! you and me!!!

source: 네, 넷?!
en: y-yes, master?!

source: 너 정말 목적이 그게 전부인 거지?
en: that’s your only goal, right?

source: 그러니까.
en: so.

source: 앞으로 잘하겠다고 하니…
en: and it says it’ll be nicer going forward...

source: 여의주 너~!
en: euijoooo!

source: 똑똑히 기억해!!
en: I remember it clearly!

source: 야, 너 질투하냐?
en: hey, are you jealous?

source: 네 말대로 영력이 쎄서…
en: because her spiritual powers are strong, like you said...

source: 으음?
en: huuuh?

source: 내 능력은 과거로 보낼 수 있는 대신,
en: with my super power, I can send someone back to the past...

source: 태희 짱♥
en: taehee, you’re the best!

source: 이미진!!
en: mijin!

source: 얘 뭐야… 심리가 안 보여…
en: what the f*ck... why can’t I read his mind?

source: ∙∙∙ ∙∙∙ 응.
en: okay...

source: 쪼잔한 줄은 알았는데 선 넘지 마
en: I know you’re a petty jerk, but don’t cross the line.

source: 친구가 간섭하는 건 여기까지야…?
en: so this is all a friend can do?

source: 컷
en: GLARE

source: 웃기시네.
en: shut up.

source: 이미진…
en: mijin...

source: 즉…
en: meaning...

source: 웬일이야?
en: extra spicy?

source: 야 태희
en: hey, taehee.

source: 불쌍해서 이 형님이 한 번 도와준다.
en: you poor soul. i’ll help you this once.

source: 내가 아까워서?
en: because I deserve better?

source: 하느님 아버지 부처님 모든 신들께 감사합니다!!
en: oh, father god, buddha, and all gods of the universe! thank you!!!

source: 은 결코 배신하지 않는
en: EFFORT always SHOWS

source: 아니 내가…
en: but I’ll--

source: ?{j}왜?
en: why should I?{j}

source: 꺄아~ 축제때 썸남 생기는 거 아님?
en: kyah! will I find a boyfriend at the festival?

source: 귀신아…
en: hey, ghost...

source: 에휴 뭘 말하겠냐 너한테..
en: ha... what use is it explaining to you?

source: …나 진짜 미래를 제대로 볼 수 있긴 한 건가…
en: can I even see the future properly?

source: 찬규님!
en: master chankyu!

source: 커헉∙∙∙ ∙∙∙ .
en: cough...

source: 네가 찬규 님에 대해 뭘 알아!!
en: you know nothing about master chankyu!!!

source: 고오오오오
en: DOOOM

source: 애들아!
en: hey, everyone!

source: 장난인데 너무 놀라는 거 아냐?
en: I’m just kidding! why are you reacting so seriously?

source: 내가 안경 돼지면 쟨 안경 원숭이잖아!!
en: if I’m a four-eyed pig, he’s a four-eyed monkey!!!

source: 나 그냥 가면 안 되냐?
en: can I just leave?

source: 지금…?
en: now?

source: 야 이 미친놈들아
en: you ridiculous fools.

source: … 그냥 물감 튀어서 벗어 놓은 건데, 왜?
en: because I spilled paint on it. why?

source: 이젠 잘 봐도 그만 못 봐도 그만∙∙∙ ∙∙∙ .
en: it doesn’t matter if I do well or not...

source: 김…찬…규…
en: chan...kyu...

source: 다음에 또 이야기 들어줄래?
en: ...lend me an ear again if I have other issues?

source: 찬규 님, 저희는 운명이에요!!
en: master chankyu, we’re meant for each other! it’s fate!!!

source: 그러면… 그냥 무의미하잖아요…
en: then... it’s all meaningless...

source: 쓰레기는 아닌 것 같고…
en: it doesn’t look like trash...

source: 다시 말하지만,
en: let me repeat myself.

source: 내가 필요하면 이러지 말고 그냥 말해줘.
en: if you need me, just tell me instead of acting like this.

source: 마지막 한 방 정도면 내가 이기는 거라고
en: just one more blow and it’ll be my win.

source: 엇…?
en: wha...?

source: 나는 씨ㅂ~ 인권도 없냐?!
en: what about my f*cking rights?!

source: 아니… 내가 못 보는 건가…
en: or... am I just not seeing it?

source: 다시 미래가 잘 보이지 않아
en: I can’t see the future again...

source: 너네 아니었음 괜히 나만 이상한 사람 될 뻔 했잖아.
en: if it weren’t for you all, I would’ve ended up being the strange one.

source: 너네도 진짜 고생이다.
en: it must have been tough for you two.

source: 겪어보지 못한 자에게 전쟁이란 달콤한 것이다
en: war is tempting for those who have never experienced it.

source: 저 새낀 지 능력이 ㅂ신인 것도 모르나
en: doesn’t that moron know his super power sucks?

source: 그게 대를 거듭해 내려오며 피가 나눠지면서
en: then, as it was passed down through the generations, the dragon’s power became diluted...

source: 아앗!
en: ow!

source: 나랑은 조금 다른 방향의 무게라고 생각하면…
en: I can just think of it a different way... that he carries a different kind of weight...

source: 계약 연애를 해서 호기심을 해결한다-!!!
en: find the answer using a contract relationship!!!

source: 뭐야 시ㅂ 갑자기
en: why the f*ck are you in here all of a sudden?

source: 난 가능하다 그렇기에 내가 감히 특별한 것이지
en: ...I can. that’s why I am special!

source: 가볼까∙∙∙ ∙∙∙ !
en: let’s go!

source: 찬규님도 차암~♥
en: come on, master chankyu!!!

source: 삼각 레오파드…
en: leopard print brie--

source: 네, 물론이죠!
en: of course, sir!

source: 의주야~
en: euijoo!

source: 어, 신이네.
en: hi, shin.

source: 우정이란 서로의 이해관계가 일치할때 강해지고 유지된다.
en: friendship gets stronger and is maintained when interests are the same.

source: 그?
en: her?

source: 왜 서양용은 도마뱀이고 동양용은 뱀일까
en: why do dragons in the west look like lizards while dragons in the east look like snakes?

source: 그만해!!
en: stop it!!!

source: 괜찮아, 네가 낫는게 우선이지 감각은 잘 안 잊힌다잖아
en: it’s okay. getting better is your first priority. you won’t lose any of your judo skills anyway.

source: 아, 아니~ 근데 너 이름이..
en: n-nothing... your name is...?

source: 같이..?!
en: together?!

source: 여의주의 능력을 통제하고 있다는 거겠지.
en: ...every time he’s dealing with her.

source: 내 요청을 거절하겠다?
en: you’re going to defy my order?

source: 저 자식도 했는데 나라고…
en: that jerk did it. why can’t I?

source: 역시… 맞았어
en: I knew it.

source: 니 눈 높잖냐.
en: you have super high standards.

source: 힘을 얻으면 무슨 짓을 할지 몰라!!
en: who knows what it’ll do if it gains more power?!

source: 귀신을 보는 것이 당연해,
en: seeing ghosts was normal...

source: 와…오…
en: wo...w...

source: 기다려~~!!
en: wait for me!!!

source: 흠… 그런가…
en: hmm... I guess...

source: 아하하하하하!!
en: gahahahaha!!!

source: 강당!
en: the auditorium!

source: 음….어!
en: um... yeah!

source: 내가 지금 무슨 소릴 한 거냐…
en: but why the hell did I say that?!

source: 너한테 이러니저러니 이야기 듣고 싶지 않다고
en: I don’t need you to tell me what to do.

source: 상대방은 배려도 안 하고
en: you don’t consider other people’s opinions either.

source: 뭔데!!
en: what is it?!

source: 난 결국… 시체라도 찾았다면
en: if only... I could have found your body.

source: 후∙∙∙ 또라이 같은 놈∙∙∙ ∙∙∙ .
en: whew... that moron...

source: 진주야아-!!!
en: peaaarl!!!

source: 그러면서 연애는 싫은 거고
en: but I don’t want to date anyone.

source: 나 괜찮잖아.
en: I’m fine, aren’t I?

source: …잠깐?
en: huh? wait!

source: 그정도였나∙∙∙ ∙∙∙ ?
en: was he that frantic?

source: 너.
en: you.

source: 움찔
en: TWITCH

source: 갑자기 왜 그래?
en: hey, what’s wrong?

source: 넌 여기서 당장 성불해야 해
en: you need to go to heaven right now.

source: 솔직히
en: be honest.

source: 미정이 좀 깨워!!
en: wake mijung up!!!

source: 진주도 너도 아픈 일을 겪고 있다고 생각했으니까.
en: I thought you and pearl were having a hard time.

source: 너 하는 짓이 앞뒤가 안맞아
en: your actions don’t add up...

source: 네 걱정돼서 그렇지~
en: she’s just worried about you, pearl.

source: 그래도ᅮᅮ
en: still...

source: 그냥 저번에 꾸며줬던대로 갈까∙∙∙ ∙∙∙ .
en: should I just stick with how they dressed me last time?

source: 귀신이 잘 붙어요 ~!
en: you’re very attractive! to ghosts!!!

source: 한다고 될 것 같지도 않으니까,
en: you’re just backing out...

source: 아, 아니야~!
en: i-it’s okay!

source: 켁…
en: owww...

source: 여긴 상담 해주는 곳이지 연애 해주는 곳이 아냐!
en: isn’t this the peer counseling club, not a dating club?!

source: 안녕~
en: bye!

source: 퍼뜩
en: JOLT

source: 어때보여?
en: how do we look?

source: …뭐라고?
en: what?

source: 네가 지금 제일 수상해 시체 숨겼지
en: you’re the strangest of all right now. did you bury a corpse here or what?

source: 나도 알아서 하는 소리거든~
en: I know! I’m just kidding.

source: 그게 모에요, 아버지?
en: what words, father?

source: 친구인데, 그 정도도 못할까 봐?{j}ㅎㅎ
en: I’m willing to help a friend out!{j}

source: 엥?
en: huh?

source: 네 아버지를
en: you will think...

source: 현수막도 들고 갈게!
en: I’ll even bring huge signs!

source: 엥 그래?
en: oh. really?

source: 아니, 아무리 그래도 내가 잔반이냐 그런 노잼 부에 처리하게…
en: I mean, but still... I’m human... not some leftovers to stuff into a boring club...

source: 상관할 일 아니라는 거네
en: then I guess I don’t need to be concerned about him.

source: 와아!!
en: whoaaa!!!

source: 난 어린아이 모습으로 계속 아빠를 찾는 거야
en: that’s why I’m searching for him as one.

source: 미안, 진짜 미안!
en: sorry! I’m really sorry!

source: 그건 안되지
en: I can’t do that.

source: OO도서관으로 9시까지 와~
en: come to the library by nine!

source: 진주 지금 어딨어?
en: where’s pearl right now?

source: 넌 최면에 걸려
en: I can hypnotize you.

source: 아무 소용 없다고!
en: ...is absolutely useless!

source: 너 음악실 좀 다녀와라!
en: go clean the music room!

source: 안전 운행
en: SAFETY FIRST

source: 여기서 이야기하긴 좀 그런데…
en: I can’t talk about it here...

source: 응 좋아해!!
en: yeah! I like you!

source: 어차피 아빠는 전쟁터에서 돌아가셨을 거야 소식이 없잖아…
en: he probably passed away at the battlefields. I haven’t heard from him...

source: 김찬규!!
en: hey!

source: 저흰 운명일 수 밖에 없어요~!!
en: it’s destiny. we were fated to meet!!

source: 뭐야, 넌 여기 또 왜 왔어?
en: why are you here again?

source: 력 결코 배신하지
en: FO ... always SHOWS

source: 왠지 못 배기겠어..
en: I feel like I need to for some reason.

source: 흠… ㅈ됐네?
en: hmm... you’re screwed, huh?

source: 하고 싶은 건 나고
en: unlike me, who really wants to date.

source: 헉!!
en: ack!!!

source: 아직 50분이나 남았는데…
en: we still have 50 minutes...
